# Automate deployment, configuration, and upgrading
brew "ansible@13", link: true
# GitHub command-line tool
brew "gh"
# CLI for Drive, Gmail, Calendar, Sheets, Docs, Chat, Admin, and more
brew "googleworkspace-cli"
# Agent multiplexer that lives in your terminal
brew "herdr", restart_service: :changed
# Lightweight and flexible command-line JSON processor (required by statusline.sh)
brew "jq"
# Open-source, cross-platform JavaScript runtime environment
brew "node@24", link: true
# Fast, disk space efficient package manager
brew "pnpm"
# Pretty, minimal and fast ZSH prompt
brew "pure"
# Terminal multiplexer
brew "tmux"
# Desktop password and login vault
cask "bitwarden"
# Anthropic's official Claude AI desktop app
cask "claude"
# Terminal-based AI coding assistant
cask "claude-code"
# Screen capturing tool
cask "cleanshot"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Cross-platform Git credential storage for multiple hosting providers
cask "git-credential-manager"
# Desktop client for GitHub repositories
cask "github"
# Web browser
cask "google-chrome"
# Graphically shows disk usage within a file system
cask "grandperspective"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Control your tools with a few keystrokes
cask "raycast"
# Native GUI tool for relational databases
cask "tableplus"
# Multimedia player
cask "vlc"
# Multiplayer code editor
cask "zed"
# Gecko based web browser
cask "zen"
npm "corepack"
